
## Plan Result (stg)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 16 to add, 2 to change, 21 to destroy.</code></pre>

* Create
  * azurerm_storage_blob.b2c_config[&#34;b2c.js&#34;]
  * azurerm_storage_blob.b2c_config[&#34;main.css&#34;]
  * azurerm_storage_blob.b2c_config[&#34;template.html&#34;]
  * azurerm_storage_blob.b2c_config_assets[&#34;bold-affa96571d-v2.woff&#34;]
  * azurerm_storage_blob.b2c_config_assets[&#34;bold-b542beb274-v2.woff2&#34;]
  * azurerm_storage_blob.b2c_config_assets[&#34;favicon.ico&#34;]
  * azurerm_storage_blob.b2c_config_assets[&#34;favicon.svg&#34;]
  * azurerm_storage_blob.b2c_config_assets[&#34;govuk-crest-2x.png&#34;]
  * azurerm_storage_blob.b2c_config_assets[&#34;govuk-crest.png&#34;]
  * azurerm_storage_blob.b2c_config_assets[&#34;govuk-icon-180.png&#34;]
  * azurerm_storage_blob.b2c_config_assets[&#34;govuk-icon-192.png&#34;]
  * azurerm_storage_blob.b2c_config_assets[&#34;govuk-icon-512.png&#34;]
  * azurerm_storage_blob.b2c_config_assets[&#34;govuk-icon-mask.svg&#34;]
  * azurerm_storage_blob.b2c_config_assets[&#34;govuk-opengraph-image.png&#34;]
  * azurerm_storage_blob.b2c_config_assets[&#34;light-94a07e06a1-v2.woff2&#34;]
  * azurerm_storage_blob.b2c_config_assets[&#34;light-f591b13f7d-v2.woff&#34;]
* Update
  * module.data_gateway_vm[0].azurerm_windows_virtual_machine.winvm[0]
  * module.data_gateway_vm[1].azurerm_windows_virtual_machine.winvm[0]
* Delete
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/fonts/bold-affa96571d-v2.woff&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/fonts/bold-b542beb274-v2.woff2&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/fonts/light-94a07e06a1-v2.woff2&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/fonts/light-f591b13f7d-v2.woff&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/favicon.ico&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/favicon.svg&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-crest-2x.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-crest.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-icon-180.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-icon-192.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-icon-512.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-icon-mask.svg&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/images/govuk-opengraph-image.png&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/assets/manifest.json&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/css/govuk-frontend-5.2.0.min.css&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/css/govuk-frontend-5.2.0.min.css.map&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/css/main.css&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/js/b2c.js&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/js/govuk-frontend-5.2.0.min.js&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/js/govuk-frontend-5.2.0.min.js.map&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/template.html&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_blob.b2c_config["b2c.js"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_type           = "application/javascript"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "js/b2c.js"
      + parallelism            = 8
      + size                   = 0
      + source_content         = <<-EOT
            function moveForgotPassword() {
              const forgotPasswordId = 'forgotPassword'
              const forgotPassword = document.getElementById(forgotPasswordId);
            
              if (forgotPassword) {
                const text = forgotPassword.innerHTML;
                forgotPassword.remove();
            
                const newForgotPassword = document.createElement('a');
                newForgotPassword.id = forgotPasswordId;
                newForgotPassword.innerHTML = text;
                newForgotPassword.href = forgotPassword.href;
            
                const div = document.createElement('div');
                div.appendChild(newForgotPassword);
            
                const passwordInput = document.getElementById('password');
                passwordInput.parentNode.insertBefore(div, passwordInput.nextSibling);
              }
            }
            function moveRetryCode() {
              const retryCode = document.getElementById('retryCode');
            
              if (retryCode) {
                const text = retryCode.innerHTML;
                retryCode.remove();
            
                const newRetryCode = document.createElement('a');
                newRetryCode.id = 'retryCode';
                newRetryCode.innerHTML = text;
            
                const div = document.createElement('div');
                div.appendChild(newRetryCode);
            
                const verificationCodeInput = document.getElementById('verificationCode');
                verificationCodeInput.parentNode.insertBefore(div, verificationCodeInput.nextSibling);
              }
            }
            
            function addTsAndCsLink() {
              const tsAndCsBlock = document.getElementsByClassName('CheckboxMultiSelect')[0];
              if (tsAndCsBlock) {
                const tsAndCsLabel = tsAndCsBlock.getElementsByTagName('label')[0];
                const tsAndCsText = tsAndCsBlock.getElementsByTagName('label')[1];
                // fix the wrong for attribute supplied by B2C
                tsAndCsLabel.setAttribute('for', tsAndCsText.getAttribute('for'));
                if (tsAndCsText) {
                  tsAndCsText.innerHTML = tsAndCsText.innerHTML = 'I agree to the <a href="https://pre-portal.staging.platform.hmcts.net/terms-and-conditions" target="_blank">Terms &amp; Conditions</a> (including Acceptable Use) for the Section 28 Video on Demand Portal.'
                }
              }
            }
            
            function addPasswordCriteria() {
              const passwordAttrEntry = document.querySelector('#attributeList li.Password .attrEntry');
              // passwordAttrEntry.setAttribute('style', 'margin-bottom: 2px;');
              const passwordDetails = document.createElement('details');
              passwordDetails.setAttribute('class', 'govuk-details');
              passwordDetails.setAttribute('data-module', 'govuk-details');
              passwordDetails.setAttribute('style', 'margin-top: 2px;');
              passwordDetails.innerHTML = '<summary class="govuk-details__summary">\n' +
                '                          <span class="govuk-details__summary-text">Password criteria</span>\n' +
                '                        </summary>\n' +
                '                        <div class="govuk-details__text">\n' +
                '                          Passwords must have at least 8 characters. <br />\n' +
                '                          Passwords must contain characters from at least three of the\n' +
                '                          following four classes: uppercase, lowercase, digit, and\n' +
                '                          non-alphanumeric (special).\n' +
                '                        </div>';
              passwordAttrEntry.appendChild(passwordDetails);
            }
            
            function lowerCaseEmailAddresses() {
              // for our TLD email validation policy to work, we need the tld to be in lowercase...
              const emailInput = document.getElementById('email');
              emailInput.onblur = function() {
                emailInput.value = emailInput.value.toLowerCase();
              }
              const signInName = document.getElementById('signInName');
              signInName.onblur = function() {
                signInName.value = signInName.value.toLowerCase();
              }
            }
            
            $(function() {
              moveForgotPassword();
              moveRetryCode();
              addTsAndCsLink();
              addPasswordCriteria();
              lowerCaseEmailAddresses();
            });
        EOT
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/fonts/bold-affa96571d-v2.woff"] will be destroyed
  # (because key ["b2c/views/assets/fonts/bold-affa96571d-v2.woff"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "affa96571d94a9ab7d95b0850b26edde" -> null
      - content_type           = "font/woff" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/bold-affa96571d-v2.woff" -> null
      - metadata               = {} -> null
      - name                   = "assets/fonts/bold-affa96571d-v2.woff" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/fonts/bold-affa96571d-v2.woff" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/bold-affa96571d-v2.woff" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/fonts/bold-b542beb274-v2.woff2"] will be destroyed
  # (because key ["b2c/views/assets/fonts/bold-b542beb274-v2.woff2"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "b542beb2746ca0e4a5a9aa7ea7767df7" -> null
      - content_type           = "font/woff2" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/bold-b542beb274-v2.woff2" -> null
      - metadata               = {} -> null
      - name                   = "assets/fonts/bold-b542beb274-v2.woff2" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/fonts/bold-b542beb274-v2.woff2" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/bold-b542beb274-v2.woff2" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/fonts/light-94a07e06a1-v2.woff2"] will be destroyed
  # (because key ["b2c/views/assets/fonts/light-94a07e06a1-v2.woff2"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "94a07e06a104e76fe40583f74b204aee" -> null
      - content_type           = "font/woff2" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/light-94a07e06a1-v2.woff2" -> null
      - metadata               = {} -> null
      - name                   = "assets/fonts/light-94a07e06a1-v2.woff2" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/fonts/light-94a07e06a1-v2.woff2" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/light-94a07e06a1-v2.woff2" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/fonts/light-f591b13f7d-v2.woff"] will be destroyed
  # (because key ["b2c/views/assets/fonts/light-f591b13f7d-v2.woff"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "f591b13f7daad512cf0dfa0ddcb2960e" -> null
      - content_type           = "font/woff" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/light-f591b13f7d-v2.woff" -> null
      - metadata               = {} -> null
      - name                   = "assets/fonts/light-f591b13f7d-v2.woff" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/fonts/light-f591b13f7d-v2.woff" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/light-f591b13f7d-v2.woff" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/favicon.ico"] will be destroyed
  # (because key ["b2c/views/assets/images/favicon.ico"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "a90776c99cc9bf3d9dbe593284d6bbf6" -> null
      - content_type           = "image/x-ico" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.ico" -> null
      - metadata               = {} -> null
      - name                   = "assets/images/favicon.ico" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/images/favicon.ico" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.ico" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/favicon.svg"] will be destroyed
  # (because key ["b2c/views/assets/images/favicon.svg"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "e1321ba525137ed156ed48e69369531c" -> null
      - content_type           = "image/svg+xml" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.svg" -> null
      - metadata               = {} -> null
      - name                   = "assets/images/favicon.svg" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/images/favicon.svg" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.svg" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-crest-2x.png"] will be destroyed
  # (because key ["b2c/views/assets/images/govuk-crest-2x.png"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "57a05afc1fc634420a02ff0151675de0" -> null
      - content_type           = "image/png" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-crest-2x.png" -> null
      - metadata               = {} -> null
      - name                   = "assets/images/govuk-crest-2x.png" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/images/govuk-crest-2x.png" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-crest-2x.png" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-crest.png"] will be destroyed
  # (because key ["b2c/views/assets/images/govuk-crest.png"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "bcd5768bd7721641ee71ba103bb38900" -> null
      - content_type           = "image/png" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-crest.png" -> null
      - metadata               = {} -> null
      - name                   = "assets/images/govuk-crest.png" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/images/govuk-crest.png" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-crest.png" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-icon-180.png"] will be destroyed
  # (because key ["b2c/views/assets/images/govuk-icon-180.png"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "ae577696a9d0466ee2019f46ec4c684f" -> null
      - content_type           = "image/png" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-180.png" -> null
      - metadata               = {} -> null
      - name                   = "assets/images/govuk-icon-180.png" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/images/govuk-icon-180.png" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-180.png" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-icon-192.png"] will be destroyed
  # (because key ["b2c/views/assets/images/govuk-icon-192.png"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "2c48a90c9944fc69e87574d06646f3ec" -> null
      - content_type           = "image/png" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-192.png" -> null
      - metadata               = {} -> null
      - name                   = "assets/images/govuk-icon-192.png" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/images/govuk-icon-192.png" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-192.png" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-icon-512.png"] will be destroyed
  # (because key ["b2c/views/assets/images/govuk-icon-512.png"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "eef7f360c29c4ef113b058b4d7677550" -> null
      - content_type           = "image/png" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-512.png" -> null
      - metadata               = {} -> null
      - name                   = "assets/images/govuk-icon-512.png" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/images/govuk-icon-512.png" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-512.png" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-icon-mask.svg"] will be destroyed
  # (because key ["b2c/views/assets/images/govuk-icon-mask.svg"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - content_md5            = "ff75b23964656ce28eece43f266d9f1d" -> null
      - content_type           = "image/svg+xml" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-mask.svg" -> null
      - metadata               = {} -> null
      - name                   = "assets/images/govuk-icon-mask.svg" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/views/assets/images/govuk-icon-mask.svg" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-mask.svg" -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/assets/images/govuk-opengraph-image.png"] will be destroyed
  # (because key ["b2c/views/assets/images/govuk-opengraph-image.png"] is not in for_each map)
  - resource "azurerm_storage_blob" "b2c_config" {
      - access_tier            = "Hot" -> null
      - co

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

-2-.1-2.4-1-.4-.9.1-2 1-2.4.9-.4 2 .1 2.4 1s-.1 2-1 2.4M17 4.7l2.3 1.2V2.5l-2.3.7-.2-.2.9-3h-3.4l.9 3-.2.2c-.1.1-2.3-.7-2.3-.7v3.4L15 4.7c.1.1.1.2.2.2l-1.3 4c-.1.2-.1.4-.1.6 0 1.1.8 2 1.9 2.2h.7c1-.2 1.9-1.1 1.9-2.1 0-.2 0-.4-.1-.6l-1.3-4c-.1-.2 0-.2.1-.3m-7.6 5.7c.9.4 2-.1 2.4-1 .4-.9-.1-2-1-2.4-.9-.4-2 .1-2.4 1s0 2 1 2.4m-5 3c.9.4 2-.1 2.4-1 .4-.9-.1-2-1-2.4-.9-.4-2 .1-2.4 1s.1 2 1 2.4m-3.2 4.8c.9.4 2-.1 2.4-1 .4-.9-.1-2-1-2.4-.9-.4-2 .1-2.4 1s0 2 1 2.4m14.8 11c4.4 0 8.6.3 12.3.8 1.1-4.5 2.4-7 3.7-8.8l-2.5-.9c.2 1.3.3 1.9 0 2.7-.4-.4-.8-1.1-1.1-2.3l-1.2 4c.7-.5 1.3-.8 2-.9-1.1 2.5-2.6 3.1-3.5 3-1.1-.2-1.7-1.2-1.5-2.1.3-1.2 1.5-1.5 2.1-.1 1.1-2.3-.8-3-2-2.3 1.9-1.9 2.1-3.5.6-5.6-2.1 1.6-2.1 3.2-1.2 5.5-1.2-1.4-3.2-.6-2.5 1.6.9-1.4 2.1-.5 1.9.8-.2 1.1-1.7 2.1-3.5 1.9-2.7-.2-2.9-2.1-2.9-3.6.7-.1 1.9.5 2.9 1.9l.4-4.3c-1.1 1.1-2.1 1.4-3.2 1.4.4-1.2 2.1-3 2.1-3h-5.4s1.7 1.9 2.1 3c-1.1 0-2.1-.2-3.2-1.4l.4 4.3c1-1.4 2.2-2 2.9-1.9-.1 1.5-.2 3.4-2.9 3.6-1.9.2-3.4-.8-3.5-1.9-.2-1.3 1-2.2 1.9-.8.7-2.3-1.2-3-2.5-1.6.9-2.2.9-3.9-1.2-5.5-1.5 2-1.3 3.7.6 5.6-1.2-.7-3.1 0-2 2.3.6-1.4 1.8-1.1 2.1.1.2.9-.3 1.9-1.5 2.1-.9.2-2.4-.5-3.5-3 .6 0 1.2.3 2 .9l-1.2-4c-.3 1.1-.7 1.9-1.1 2.3-.3-.8-.2-1.4 0-2.7l-2.9.9C1.3 23 2.6 25.5 3.7 30c3.7-.5 7.9-.8 12.3-.8m28.3-11.6c0 .9.1 1.7.3 2.5.2.8.6 1.5 1 2.2.5.6 1 1.1 1.7 1.5.7.4 1.5.6 2.5.6.9 0 1.7-.1 2.3-.4s1.1-.7 1.5-1.1c.4-.4.6-.9.8-1.5.1-.5.2-1 .2-1.5v-.2h-5.3v-3.2h9.4V28H55v-2.5c-.3.4-.6.8-1 1.1-.4.3-.8.6-1.3.9-.5.2-1 .4-1.6.6s-1.2.2-1.8.2c-1.5 0-2.9-.3-4-.8-1.2-.6-2.2-1.3-3-2.3-.8-1-1.4-2.1-1.8-3.4-.3-1.4-.5-2.8-.5-4.3s.2-2.9.7-4.2c.5-1.3 1.1-2.4 2-3.4.9-1 1.9-1.7 3.1-2.3 1.2-.6 2.6-.8 4.1-.8 1 0 1.9.1 2.8.3.9.2 1.7.6 2.4 1s1.4.9 1.9 1.5c.6.6 1 1.3 1.4 2l-3.7 2.1c-.2-.4-.5-.9-.8-1.2-.3-.4-.6-.7-1-1-.4-.3-.8-.5-1.3-.7-.5-.2-1.1-.2-1.7-.2-1 0-1.8.2-2.5.6-.7.4-1.3.9-1.7 1.5-.5.6-.8 1.4-1 2.2-.3.8-.4 1.9-.4 2.7zM71.5 6.8c1.5 0 2.9.3 4.2.8 1.2.6 2.3 1.3 3.1 2.3.9 1 1.5 2.1 2 3.4s.7 2.7.7 4.2-.2 2.9-.7 4.2c-.4 1.3-1.1 2.4-2 3.4-.9 1-1.9 1.7-3.1 2.3-1.2.6-2.6.8-4.2.8s-2.9-.3-4.2-.8c-1.2-.6-2.3-1.3-3.1-2.3-.9-1-1.5-2.1-2-3.4-.4-1.3-.7-2.7-.7-4.2s.2-2.9.7-4.2c.4-1.3 1.1-2.4 2-3.4.9-1 1.9-1.7 3.1-2.3 1.2-.5 2.6-.8 4.2-.8zm0 17.6c.9 0 1.7-.2 2.4-.5s1.3-.8 1.7-1.4c.5-.6.8-1.3 1.1-2.2.2-.8.4-1.7.4-2.7v-.1c0-1-.1-1.9-.4-2.7-.2-.8-.6-1.6-1.1-2.2-.5-.6-1.1-1.1-1.7-1.4-.7-.3-1.5-.5-2.4-.5s-1.7.2-2.4.5-1.3.8-1.7 1.4c-.5.6-.8 1.3-1.1 2.2-.2.8-.4 1.7-.4 2.7v.1c0 1 .1 1.9.4 2.7.2.8.6 1.6 1.1 2.2.5.6 1.1 1.1 1.7 1.4.6.3 1.4.5 2.4.5zM88.9 28 83 7h4.7l4 15.7h.1l4-15.7h4.7l-5.9 21h-5.7zm28.8-3.6c.6 0 1.2-.1 1.7-.3.5-.2 1-.4 1.4-.8.4-.4.7-.8.9-1.4.2-.6.3-1.2.3-2v-13h4.1v13.6c0 1.2-.2 2.2-.6 3.1s-1 1.7-1.8 2.4c-.7.7-1.6 1.2-2.7 1.5-1 .4-2.2.5-3.4.5-1.2 0-2.4-.2-3.4-.5-1-.4-1.9-.9-2.7-1.5-.8-.7-1.3-1.5-1.8-2.4-.4-.9-.6-2-.6-3.1V6.9h4.2v13c0 .8.1 1.4.3 2 .2.6.5 1 .9 1.4.4.4.8.6 1.4.8.6.2 1.1.3 1.8.3zm13-17.4h4.2v9.1l7.4-9.1h5.2l-7.2 8.4L148 28h-4.9l-5.5-9.4-2.7 3V28h-4.2V7zm-27.6 16.1c-1.5 0-2.7 1.2-2.7 2.7s1.2 2.7 2.7 2.7 2.7-1.2 2.7-2.7-1.2-2.7-2.7-2.7z"></path>
                        </svg>
                      </a>
                    </div>
                    <div class="govuk-header__content">
                      <a href="https://pre-portal.staging.platform.hmcts.net/" class="govuk-header__link govuk-header__service-name">
                        HMCTS Pre-Recorded Evidence Service
                      </a>
                    </div>
                  </div>
                </header>
            
                <main class="govuk-main-wrapper" id="main-content" role="main">
                  <div class="govuk-width-container">
                      <div class="govuk-grid-row">
                        <div class="govuk-grid-column-two-thirds">
            
                          <div id="api">
                            <!-- B2C content goes here -->
                          </div>
            
                        </div>
                      </div>
                  </div>
                </main>
            
                <footer class="govuk-footer" role="contentinfo">
                  <div class="govuk-width-container">
                    <div class="govuk-footer__meta">
                      <div class="govuk-footer__meta-item govuk-footer__meta-item--grow">
                        <h2 class="govuk-visually-hidden">Support links</h2>
                        <ul class="govuk-footer__inline-list">
                          <li class="govuk-footer__inline-list-item">
                            <a class="govuk-footer__link" href="https://pre-portal.staging.platform.hmcts.net/terms-and-conditions" target="_blank">
                              Terms and conditions
                            </a>
                          </li>
                          <li class="govuk-footer__inline-list-item">
                            <a class="govuk-footer__link" href="https://pre-portal.staging.platform.hmcts.net/accessibility-statement" target="_blank">
                              Accessibility statement
                            </a>
                          </li>
                        </ul>
                        <svg aria-hidden="true" focusable="false" class="govuk-footer__licence-logo" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 483.2 195.7" height="17" width="41">
                          <path fill="currentColor" d="M421.5 142.8V.1l-50.7 32.3v161.1h112.4v-50.7zm-122.3-9.6A47.12 47.12 0 0 1 221 97.8c0-26 21.1-47.1 47.1-47.1 16.7 0 31.4 8.7 39.7 21.8l42.7-27.2A97.63 97.63 0 0 0 268.1 0c-36.5 0-68.3 20.1-85.1 49.7A98 98 0 0 0 97.8 0C43.9 0 0 43.9 0 97.8s43.9 97.8 97.8 97.8c36.5 0 68.3-20.1 85.1-49.7a97.76 97.76 0 0 0 149.6 25.4l19.4 22.2h3v-87.8h-80l24.3 27.5zM97.8 145c-26 0-47.1-21.1-47.1-47.1s21.1-47.1 47.1-47.1 47.2 21 47.2 47S123.8 145 97.8 145"></path>
                        </svg>
                        <span class="govuk-footer__licence-description">
                            All content is available under the
                            <a class="govuk-footer__link" href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/" rel="license">Open Government Licence v3.0</a>, except where otherwise stated
                        </span>
                      </div>
                      <div class="govuk-footer__meta-item">
                        <a class="govuk-footer__link govuk-footer__copyright-logo" href="https://www.nationalarchives.gov.uk/information-management/re-using-public-sector-information/uk-government-licensing-framework/crown-copyright/">© Crown copyright</a>
                      </div>
                    </div>
                  </div>
                </footer>
              </body>
            </html>
        EOT
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config_assets["bold-affa96571d-v2.woff"] will be created
  + resource "azurerm_storage_blob" "b2c_config_assets" {
      + access_tier            = (known after apply)
      + content_md5            = "affa96571d94a9ab7d95b0850b26edde"
      + content_type           = "font/woff"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "assets/fonts/bold-affa96571d-v2.woff"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/fonts/bold-affa96571d-v2.woff"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config_assets["bold-b542beb274-v2.woff2"] will be created
  + resource "azurerm_storage_blob" "b2c_config_assets" {
      + access_tier            = (known after apply)
      + content_md5            = "b542beb2746ca0e4a5a9aa7ea7767df7"
      + content_type           = "font/woff2"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "assets/fonts/bold-b542beb274-v2.woff2"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/fonts/bold-b542beb274-v2.woff2"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config_assets["favicon.ico"] will be created
  + resource "azurerm_storage_blob" "b2c_config_assets" {
      + access_tier            = (known after apply)
      + content_md5            = "a90776c99cc9bf3d9dbe593284d6bbf6"
      + content_type           = "image/x-ico"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "assets/images/favicon.ico"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/images/favicon.ico"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config_assets["favicon.svg"] will be created
  + resource "azurerm_storage_blob" "b2c_config_assets" {
      + access_tier            = (known after apply)
      + content_md5            = "e1321ba525137ed156ed48e69369531c"
      + content_type           = "image/svg+xml"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "assets/images/favicon.svg"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/images/favicon.svg"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config_assets["govuk-crest-2x.png"] will be created
  + resource "azurerm_storage_blob" "b2c_config_assets" {
      + access_tier            = (known after apply)
      + content_md5            = "57a05afc1fc634420a02ff0151675de0"
      + content_type           = "image/png"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "assets/images/govuk-crest-2x.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/images/govuk-crest-2x.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config_assets["govuk-crest.png"] will be created
  + resource "azurerm_storage_blob" "b2c_config_assets" {
      + access_tier            = (known after apply)
      + content_md5            = "bcd5768bd7721641ee71ba103bb38900"
      + content_type           = "image/png"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "assets/images/govuk-crest.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/images/govuk-crest.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config_assets["govuk-icon-180.png"] will be created
  + resource "azurerm_storage_blob" "b2c_config_assets" {
      + access_tier            = (known after apply)
      + content_md5            = "ae577696a9d0466ee2019f46ec4c684f"
      + content_type           = "image/png"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "assets/images/govuk-icon-180.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/images/govuk-icon-180.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config_assets["govuk-icon-192.png"] will be created
  + resource "azurerm_storage_blob" "b2c_config_assets" {
      + access_tier            = (known after apply)
      + content_md5            = "2c48a90c9944fc69e87574d06646f3ec"
      + content_type           = "image/png"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "assets/images/govuk-icon-192.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/images/govuk-icon-192.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config_assets["govuk-icon-512.png"] will be created
  + resource "azurerm_storage_blob" "b2c_config_assets" {
      + access_tier            = (known after apply)
      + content_md5            = "eef7f360c29c4ef113b058b4d7677550"
      + content_type           = "image/png"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "assets/images/govuk-icon-512.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/images/govuk-icon-512.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config_assets["govuk-icon-mask.svg"] will be created
  + resource "azurerm_storage_blob" "b2c_config_assets" {
      + access_tier            = (known after apply)
      + content_md5            = "ff75b23964656ce28eece43f266d9f1d"
      + content_type           = "image/svg+xml"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "assets/images/govuk-icon-mask.svg"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/images/govuk-icon-mask.svg"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config_assets["govuk-opengraph-image.png"] will be created
  + resource "azurerm_storage_blob" "b2c_config_assets" {
      + access_tier            = (known after apply)
      + content_md5            = "08c923d1fcc2fe3e69e73bfbf539fa6f"
      + content_type           = "image/png"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "assets/images/govuk-opengraph-image.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/images/govuk-opengraph-image.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config_assets["light-94a07e06a1-v2.woff2"] will be created
  + resource "azurerm_storage_blob" "b2c_config_assets" {
      + access_tier            = (known after apply)
      + content_md5            = "94a07e06a104e76fe40583f74b204aee"
      + content_type           = "font/woff2"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "assets/fonts/light-94a07e06a1-v2.woff2"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/fonts/light-94a07e06a1-v2.woff2"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config_assets["light-f591b13f7d-v2.woff"] will be created
  + resource "azurerm_storage_blob" "b2c_config_assets" {
      + access_tier            = (known after apply)
      + content_md5            = "f591b13f7daad512cf0dfa0ddcb2960e"
      + content_type           = "font/woff"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "assets/fonts/light-f591b13f7d-v2.woff"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/fonts/light-f591b13f7d-v2.woff"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # module.data_gateway_vm[0].azurerm_windows_virtual_machine.winvm[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "winvm" {
        id                                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/dg-vm1-stg"
        name                                                   = "dg-vm1-stg"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (41 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_gateway_vm[1].azurerm_windows_virtual_machine.winvm[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "winvm" {
        id                                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/dg-vm2-stg"
        name                                                   = "dg-vm2-stg"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (41 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 16 to add, 2 to change, 21 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":817,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->